<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img
 src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/alx-courses/aice/assets/Content_page_banner_blue_dots.png"
 alt="ALX Content Header"
 class="full-width-image"
/>
</div>

# Creating views 1

In this exercise, we learn how to create different types of views and how to drop views. 

Ensure that you have downloaded the database file Chinook.db.

## Learning objectives

By the end of this train, you should be able to:
- Create `LOOKUP`, `JOIN`, and `AGGREGATING` views.
- Drop a view.

First, let's load our sample database:

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

c:\Users\PC\anaconda3\envs\DS_Python\Lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
# Load the Chinook database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///chinook.db

Here is a [view](https://www.lucidchart.com/pages/er-diagrams) of all of our tables in the database:

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://github.com/Explore-AI/Pictures/blob/master/sqlite-sample-database-color.jpg?raw=true"  style="width:500px";/>
<br>
<br>
    <em>Figure 1: Chinook ERD</em>
</div>

## Exercise

Run the necessary queries that will provide us with the following information. Compare your queries with the solutions at the end of this notebook.

### Exercise 1

Create a `LOOKUP` view of the surname, first name, title, and country of each employee called `Employee_View`.

In [3]:
%%sql

CREATE VIEW Employee_View AS 

SELECT
    LastName,
    FirstName,
    Title,
    Country
FROM
    employees;

 * sqlite:///chinook.db
Done.

[]

### Exercise 2


Query the `Employee_View` view to get a view of the sales team.

Use the wildcard operators and the LIKE query to filter all the employees in the specified view.

In [4]:
%sql SELECT * FROM Employee_View;

 * sqlite:///chinook.db
Done.

[('Adams', 'Andrew', 'General Manager', 'Canada'),
 ('Edwards', 'Nancy', 'Sales Manager', 'Canada'),
 ('Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Park', 'Margaret', 'Sales Support Agent', 'Canada'),
 ('Johnson', 'Steve', 'Sales Support Agent', 'Canada'),
 ('Mitchell', 'Michael', 'IT Manager', 'Canada'),
 ('King', 'Robert', 'IT Staff', 'Canada'),
 ('Callahan', 'Laura', 'IT Staff', 'Canada')]

### Exercise 3


Create a `JOIN` view that will link up all the customers with the support staff assisting them, called `Customer_Support_View`. We want to view the following:

- First name of the customer
- Last name (surname) of the customer
- Country where the customer resides
- SupportRepId
- EmployeeId
- Last name of the employee
- First name of the employee
- Job title of the employee
- Country where the employee operated from

In [5]:
%%sql

CREATE VIEW Customer_Support_View AS 

SELECT
    cust.FirstName,
    cust.LastName,
    cust.Country,
    cust.SupportRepId,
    e.EmployeeId,
    e.LastName,
    e.FirstName,
    e.Title,
    e.Country
FROM
    customers cust
INNER JOIN
    employees e
    ON cust.Country = e.Country;

 * sqlite:///chinook.db
Done.

[]

### Exercise 4

Query the `Customer_Support_View` view to get a list of the names and surnames of the clients who were helped by an employee with the `Employeeid` '3'.

In [9]:
%sql SELECT FirstName, LastName, EmployeeId FROM Customer_Support_View WHERE EmployeeId = 3;

 * sqlite:///chinook.db
Done.

[('François', 'Tremblay', 3),
 ('Mark', 'Philips', 3),
 ('Jennifer', 'Peterson', 3),
 ('Robert', 'Brown', 3),
 ('Edward', 'Francis', 3),
 ('Martha', 'Silk', 3),
 ('Aaron', 'Mitchell', 3),
 ('Ellie', 'Sullivan', 3)]

### Exercise 5

Create an `AGGREGATING` view that counts the number of customers that are currently being serviced per country, called `Customer_per_Country_View`.

We would like to see the country name and the number of customers in this view.

In [22]:
%%sql

CREATE VIEW Customer_per_Country_View AS 

SELECT
    Country,
    COUNT(CustomerId) AS 'Customer_Count'
FROM
    customers
GROUP BY
    Country;

 * sqlite:///chinook.db
Done.

[]

### Exercise 6
Write a query that returns the country with the most customers from `Customer_per_Country_View`.

In [26]:
%sql SELECT * FROM Customer_per_Country_View ORDER BY Customer_Count DESC LIMIT 1;

 * sqlite:///chinook.db
Done.

[('USA', 13)]

### Exercise 7

Write a query that will delete the `Employee_View` view.

In [28]:
%sql DROP VIEW Employee_View;

 * sqlite:///chinook.db
Done.

[]

### Challenge question

Write a query that returns the number of customers that each support employee services, along with the name of the employee. Call this view `Support_Person_Stats`.

To do this, we will need to create a view, join the Customer and Employee tables, and use the `COUNT` and `GROUP BY` functions to aggregate the number of employees serviced by each employee.

In [29]:
%%sql

CREATE VIEW Support_Person_Stats AS 

SELECT
    e.FirstName,
    e.LastName,
    e.EmployeeId,
    COUNT(CustomerId) AS 'Number_of_Customers'
FROM
    customers c
INNER JOIN
    employees e 
    ON c.SupportRepId = e.EmployeeId
GROUP BY 
    EmployeeId;

 * sqlite:///chinook.db
Done.

[]

## Solutions

### Exercise 1

In [ ]:
%%sql

CREATE VIEW Employee_View AS 
SELECT LastName, FirstName, Title, Country
FROM Employees;

### Exercise 2

In [ ]:
%%sql

SELECT * FROM Employee_View
WHERE Title LIKE '%Sales%'

### Exercise 3

In [ ]:
%%sql

CREATE VIEW Customer_Support_View AS
SELECT c.FirstName Customer_Name, c.LastName Customer_Surname, c.Country Customer_Country, c.SupportRepId, e.EmployeeId, e.LastName Employee_surname, e.FirstName Employee_first_name, e.Title Employee_job_title, e.Country Employee_Country
FROM customers c 
INNER JOIN employees e
ON c.SupportRepId = e.EmployeeId

### Exercise 4

In [ ]:
%%sql

SELECT Customer_Name, Customer_Surname 
FROM Customer_Support_View
WHERE Employeeid = 3;

### Exercise 5

In [ ]:
%%sql

CREATE VIEW Customer_per_Country_View AS 
SELECT COUNT (CustomerId) AS Num_customers, Country
FROM customers
GROUP BY Country;

### Exercise 6

In [ ]:
%%sql

SELECT Country, MAX(Num_customers) 
FROM Customer_per_Country_View

### Exercise 7

In [ ]:
%%sql

DROP VIEW Employee_View

### Challenge question

In [ ]:
%%sql

CREATE VIEW Support_Person_Stats AS
SELECT COUNT(c.SupportRepId) Count_of_Customers_Serviced , e.EmployeeId, e.LastName
FROM customers c 
INNER JOIN employees e
ON c.SupportRepId = e.EmployeeId
GROUP BY e.EmployeeId;

* Note: Because views are added to the main database after they are created, if we want to perform the `CREATE VIEW` commands again, we must first drop the prior view to prevent receiving a 'VIEW already exists' error.

#

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/refs/heads/master/ALX_banners/ALX_Navy.png"  style="width:100px"  ;/>
</div>